Repository: vakesz/Glasstual
Catalog: Sources/App/Features/Rules/Rules.xcstrings
Source language: en
Languages: de, hu

source: All channels selected
de: Alle Kanäle ausgewählt
hu: Minden csatorna kiválasztva

source: Some channels selected
de: Einige Kanäle ausgewählt
hu: Néhány csatorna kiválasztva

source: No channels selected
de: Keine Kanäle ausgewählt
hu: Nincs kiválasztott csatorna

# action-log-user
source: Performing action defined by the filter “%1$@“ against the user “%2$@“
de: Aktion des Filters "%1$@" für Benutzer "%2$@" wird ausgeführt
hu: A(z) "%1$@" szűrő műveletének végrehajtása a(z) "%2$@" felhasználón

# action-log-user-in-channel
source: Performing action defined by the filter “%1$@“ against the user “%2$@“ in the channel “%3$@“
de: Aktion des Filters "%1$@" für Benutzer "%2$@" im Kanal "%3$@" wird ausgeführt
hu: A(z) "%1$@" szűrő műveletének végrehajtása a(z) "%2$@" felhasználón a(z) "%3$@" csatornán

# add-filter-button
source: Add Filter
de: Filter hinzufügen
hu: Szűrő hozzáadása

# cancel-button
source: Cancel
de: Abbrechen
hu: Mégse

# delete-filter-button
source: Delete Filter
de: Filter löschen
hu: Szűrő törlése

# delete-filter-message
source: There is no undo and all data related to this filter will be erased.
de: Dies kann nicht rückgängig gemacht werden. Alle Daten dieses Filters werden gelöscht.
hu: Ez nem vonható vissza. A szűrőhöz tartozó összes adat törlődik.

# delete-filter-title
source: Delete this filter?
de: Diesen Filter löschen?
hu: Törlöd ezt a szűrőt?

# duplicate-filter-button
source: Duplicate Filter
de: Filter duplizieren
hu: Szűrő megkettőzése

# duplicate-filter-title
source: %@ (Duplicate)
de: %@ (Kopie)
hu: %@ (másolat)

# edit-filter-button
source: Edit Filter
de: Filter bearbeiten
hu: Szűrő szerkesztése

# edited-filter-removed
source: This filter no longer exists. Your changes were not saved.
de: Dieser Filter ist nicht mehr vorhanden. Deine Änderungen wurden nicht gesichert.
hu: Ez a szűrő már nem létezik. A módosításaid nem lettek elmentve.

# forwarded-message
source: Message(%1$@): %2$@
de: Nachricht (%1$@): %2$@
hu: Üzenet (%1$@): %2$@

# save-failed-title
source: The filter could not be saved
de: Der Filter konnte nicht gesichert werden
hu: Nem sikerült menteni a szűrőt

# export-filter-button
source: Export Filter…
de: Filter exportieren…
hu: Szűrő exportálása…

# export-failed-title
source: The filter could not be exported
de: Der Filter konnte nicht exportiert werden
hu: Nem sikerült exportálni a szűrőt

# export-failed-recovery
source: Choose a folder you can write to and try again.
de: Wähle einen beschreibbaren Ordner und versuche es erneut.
hu: Válassz olyan mappát, amelybe írhatsz, majd próbáld újra.

# import-filter-button
source: Import Filter…
de: Filter importieren…
hu: Szűrő importálása…

# import-failed-title
source: The filter could not be imported
de: Der Filter konnte nicht importiert werden
hu: Nem sikerült importálni a szűrőt

# import-failed-recovery
source: Choose a filter file that Chat Filter exported.
de: Wähle eine vom Chatfilter exportierte Filterdatei.
hu: Válassz a Csevegésszűrő által exportált szűrőfájlt.

# more-actions-button
source: More Actions
de: Weitere Aktionen
hu: További műveletek

# no-filters-description
source: Add a filter to hide, forward, or act on matching messages.
de: Füge einen Filter hinzu, um passende Nachrichten auszublenden, weiterzuleiten oder Aktionen auszuführen.
hu: Adj hozzá szűrőt az illeszkedő üzenetek elrejtéséhez, továbbításához vagy műveletek végrehajtásához.

# no-filters-title
source: No Filters
de: Keine Filter
hu: Nincsenek szűrők

# action-message-event
source: Action Message
de: Aktionsnachricht
hu: Cselekvésüzenet

# additional-commands-explanation
source: Add comma-separated named commands or numerics from 1 through 999 that are not listed above.
de: Gib durch Kommas getrennte Befehlsnamen oder numerische Antworten von 1 bis 999 ein, die oben nicht aufgeführt sind.
hu: Adj meg vesszővel elválasztott parancsneveket vagy 1 és 999 közötti numerikus parancsokat, amelyek nem szerepelnek fent.

# additional-commands-placeholder
source: Additional commands and numerics
de: Weitere Befehle und numerische Antworten
hu: További parancsok és numerikus válaszok

# additional-commands-section
source: Additional Commands
de: Weitere Befehle
hu: További parancsok

# advanced-tab
source: Advanced
de: Erweitert
hu: Haladó

# age-comparator-label
source: Compare Membership Age
de: Dauer der Mitgliedschaft vergleichen
hu: Tagság időtartamának összehasonlítása

# age-seconds-label
source: Age in Seconds
de: Dauer in Sekunden
hu: Időtartam másodpercben

# channel-mode-changed-event
source: Channel Mode Changed
de: Kanalmodus geändert
hu: Csatornamód megváltozott

# channel-mode-received-event
source: Channel Mode Received
de: Kanalmodus empfangen
hu: Csatornamód érkezett

# channel-topic-changed-event
source: Channel Topic Changed
de: Kanalthema geändert
hu: Csatornatéma megváltozott

# channel-topic-received-event
source: Channel Topic Received
de: Kanalthema empfangen
hu: Csatornatéma érkezett

# channels-destination
source: Channels Only
de: Nur Kanäle
hu: Csak csatornák

# channels-tab
source: Channels
de: Kanäle
hu: Csatornák

# events-tab
source: Events
de: Ereignisse
hu: Események

# filter-action-section
source: Filter Action
de: Filteraktion
hu: Szűrőművelet

# filter-match-label
source: Filter Match
de: Nachrichtenmuster
hu: Üzenetillesztés

# filter-title-label
source: Filter Title
de: Filtername
hu: Szűrő neve

# flood-control-section
source: Flood Control
de: Flood-Schutz
hu: Elárasztás elleni védelem

# flood-control-seconds-label
source: Flood Control in Seconds
de: Mindestabstand zwischen Aktionen in Sekunden
hu: Műveletek közötti minimális idő másodpercben

# forward-destination-label
source: Forward Destination
de: Weiterleitungsziel
hu: Továbbítás célja

# forward-destination-section
source: Forward Destination
de: Weiterleitungsziel
hu: Továbbítás célja

# greater-than-option
source: Greater Than
de: Größer als
hu: Nagyobb, mint

# hide-original-message-toggle
source: Hide Original Message
de: Originalnachricht ausblenden
hu: Eredeti üzenet elrejtése

# ignore-operators-toggle
source: Ignore Channel Operators
de: Kanaloperatoren ignorieren
hu: Csatornaoperátorok figyelmen kívül hagyása

# insert-placeholder-button
source: Insert Placeholder
de: Platzhalter einfügen
hu: Helyőrző beszúrása

# less-than-option
source: Less Than
de: Kleiner als
hu: Kisebb, mint

# limit-filter-label
source: Limit Filter To
de: Filter beschränken auf
hu: Szűrő korlátozása erre

# log-filter-match-toggle
source: Log Filter Match and Action
de: Filtertreffer und Aktion protokollieren
hu: Szűrőegyezés és művelet naplózása

# membership-age-section
source: Membership Age
de: Dauer der Mitgliedschaft
hu: Tagság időtartama

# no-connected-servers-title
source: No Connected Servers
de: Keine verbundenen Server
hu: Nincsenek csatlakoztatott kiszolgálók

# notes-section
source: Notes
de: Notizen
hu: Megjegyzések

# notes-tab
source: Notes
de: Notizen
hu: Megjegyzések

# notice-message-event
source: Notice Message
de: Hinweismeldung
hu: Értesítési üzenet

# only-my-messages-toggle
source: Only My Messages
de: Nur meine Nachrichten
hu: Csak a saját üzeneteim

# plain-text-message-event
source: Plain Text Message
de: Einfache Textnachricht
hu: Egyszerű szöveges üzenet

# private-messages-destination
source: Private Messages Only
de: Nur private Nachrichten
hu: Csak privát üzenetek

# save-button
source: Save
de: Sichern
hu: Mentés

# sender-match-label
source: Sender Match
de: Absendermuster
hu: Küldőillesztés

# sender-tab
source: Sender
de: Absender
hu: Küldő

# specific-items-destination
source: Specific Items
de: Bestimmte Einträge
hu: Megadott elemek

# specific-items-section
source: Specific Servers and Channels
de: Bestimmte Server und Kanäle
hu: Megadott kiszolgálók és csatornák

# standard-events-section
source: Standard Events
de: Standardereignisse
hu: Szokásos események

# unrestricted-destination
source: Unrestricted
de: Unbeschränkt
hu: Korlátozás nélkül

# user-changed-nickname-event
source: User Changed Nickname
de: Benutzer hat Nicknamen geändert
hu: Felhasználó becenevet váltott

# user-disconnected-event
source: User Disconnected
de: Benutzer getrennt
hu: Felhasználó kapcsolata bontva

# user-joined-channel-event
source: User Joined Channel
de: Benutzer ist dem Kanal beigetreten
hu: Felhasználó csatlakozott a csatornához

# user-kicked-from-channel-event
source: User Kicked from Channel
de: Benutzer wurde aus dem Kanal geworfen
hu: Felhasználót kirúgták a csatornáról

# user-left-channel-event
source: User Left Channel
de: Benutzer hat den Kanal verlassen
hu: Felhasználó elhagyta a csatornát

# zero-disables-explanation
source: Zero disables this limit.
de: Null deaktiviert dieses Limit.
hu: A nulla kikapcsolja ezt a korlátot.

# commands-invalid
source: Please enter a properly formatted list of commands. • Commands must be a comma (,) separated list. • Commands must only contain the characters: a-z, A-Z, 0-9 • Numerics must be whole numbers that are greater than zero (0) and less than or equal to 999.
de: Gib eine korrekt formatierte Befehlsliste ein. • Trenne Befehle durch Kommas (,). • Befehle dürfen nur a-z, A-Z und 0-9 enthalten. • Numerische Antworten müssen ganze Zahlen größer als null (0) und höchstens 999 sein.
hu: Adj meg megfelelő formátumú parancslistát. • A parancsokat vesszővel (,) válaszd el. • A parancsok csak a következő karaktereket tartalmazhatják: a-z, A-Z, 0-9 • A numerikus válaszok 0-nál nagyobb és legfeljebb 999 értékű egész számok lehetnek.

# destination-invalid
source: Please enter a properly formatted destination. Accepted characters: a-z, A-Z, 0-9, dashes (-), underscores (_), and spaces.
de: Gib ein korrekt formatiertes Ziel ein. Erlaubte Zeichen: a-z, A-Z, 0-9, Bindestriche (-), Unterstriche (_) und Leerzeichen.
hu: Adj meg megfelelő formátumú célt. Elfogadott karakterek: a-z, A-Z, 0-9, kötőjel (-), aláhúzásjel (_) és szóköz.

# destination-too-long
source: Please enter a shorter destination
de: Gib ein kürzeres Ziel ein
hu: Adj meg rövidebb célt

# regular-expression-invalid
source: Please enter a valid regular expression. %@
de: Gib einen gültigen regulären Ausdruck ein. %@
hu: Adj meg érvényes reguláris kifejezést. %@

# regular-expression-limits-explanation
source: Patterns are matched against at most the first %@ bytes of a message. A pattern that can take a very long time to match cannot be saved, and one that runs too long while matching is skipped until the filters change.
de: Muster werden mit höchstens den ersten %@ Byte einer Nachricht verglichen. Muster, deren Auswertung sehr lange dauern kann, können nicht gesichert werden. Dauert eine Auswertung zu lange, wird das Muster bis zur Änderung der Filter übersprungen.
hu: A mintákat legfeljebb az üzenet első %@ bájtjával vetjük össze. A túl hosszú illesztési időt igénylő minta nem menthető. Ha futás közben tart túl sokáig az illesztés, a mintát a szűrők módosításáig kihagyjuk.

# regular-expression-nested-quantifier
source: This pattern repeats a group that can match the same text in more than one way, such as (a+)+ or (.|\s)*. A pattern of that shape can take a very long time to match, so it cannot be saved. Rewrite it without the nested repetition or the overlapping alternatives.
de: Dieses Muster wiederholt eine Gruppe, die auf mehrere Arten auf denselben Text passen kann, etwa (a+)+ oder (.|\s)*. Die Auswertung kann sehr lange dauern, daher kann es nicht gesichert werden. Schreibe es ohne verschachtelte Wiederholungen oder überlappende Alternativen um.
hu: Ez a minta olyan csoportot ismétel, amely ugyanarra a szövegre többféleképpen illeszkedhet, például (a+)+ vagy (.|\s)*. Az ilyen minta illesztése túl sokáig tarthat, ezért nem menthető. Írd át egymásba ágyazott ismétlések és átfedő alternatívák nélkül.

# token-channel-name
source: Channel Name
de: Kanalname
hu: Csatornanév

# token-local-nickname
source: My Nickname
de: Mein Nickname
hu: Saját becenév

# token-network-name
source: Network Name
de: Netzwerkname
hu: Hálózat neve

# token-original-message
source: Original Message
de: Originalnachricht
hu: Eredeti üzenet

# token-parameter-1
source: Parameter #1
de: Parameter Nr. 1
hu: 1. paraméter

# token-parameter-2
source: Parameter #2
de: Parameter Nr. 2
hu: 2. paraméter

# token-parameter-3
source: Parameter #3
de: Parameter Nr. 3
hu: 3. paraméter

# token-parameter-4
source: Parameter #4
de: Parameter Nr. 4
hu: 4. paraméter

# token-parameter-5
source: Parameter #5
de: Parameter Nr. 5
hu: 5. paraméter

# token-parameter-6
source: Parameter #6
de: Parameter Nr. 6
hu: 6. paraméter

# token-parameter-7
source: Parameter #7
de: Parameter Nr. 7
hu: 7. paraméter

# token-parameter-8
source: Parameter #8
de: Parameter Nr. 8
hu: 8. paraméter

# token-parameter-9
source: Parameter #9
de: Parameter Nr. 9
hu: 9. paraméter

# token-sender-address
source: Sender Address
de: Absenderadresse
hu: Küldő címe

# token-sender-hostmask
source: Sender Hostmask
de: Hostmaske des Absenders
hu: Küldő címmaszkja

# token-sender-nickname
source: Sender Nickname
de: Nickname des Absenders
hu: Küldő beceneve

# token-sender-username
source: Sender Username
de: Benutzername des Absenders
hu: Küldő felhasználóneve

# token-server-address
source: Server Address
de: Serveradresse
hu: Kiszolgáló címe

# filter-description
source: Filter “%@“
hu: "%@" szűrő

# preferences-pane-title
source: Chat Filter
hu: Csevegésszűrő

# filter-tab
source: Filter
hu: Szűrő
